index.org
#+TITLE: Common Lisp function types
#+AUTHOR: Nathanael Schweers
