index.org
** Closing remarks
   This post is just a very brief introduction to the topic, but I felt that
   there is not so much information out there on declaring function types.  If
   you want to know more about this I can recommend the CMUCL manual, especially
   the sections on advanced compiler use.  Most of what is documented for CMUCL
   is true for SBCL.  Lots of examples of using types are given which are useful
   for other implementations too.
