index.html
<div id="outline-container-orgce7018d" class="outline-3">
<h3 id="orgce7018d"><span class="section-number-3">1.1</span> Closing remarks</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This post is just a very brief introduction to the topic, but I felt that
there is not so much information out there on declaring function types.  If
you want to know more about this I can recommend the CMUCL manual, especially
the sections on advanced compiler use.  Most of what is documented for CMUCL
is true for SBCL.  Lots of examples of using types are given which are useful
for other implementations too.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Nathanael Schweers</p>
<p class="date">Created: 2017-12-08 Fri 21:33</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
